html/hugo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hugo</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet"
href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Hugo</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgdd55c4d">blog with hugo</a>
<ul>
<li><a href="#org092d4b2">blog with hugo</a></li>
<li><a href="#org183a2cc">commands</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgdd55c4d" class="outline-2">
<h2 id="orgdd55c4d">blog with hugo</h2>
<div class="outline-text-2" id="text-orgdd55c4d">
</div>
<div id="outline-container-org092d4b2" class="outline-3">
<h3 id="org092d4b2">blog with hugo</h3>
<div class="outline-text-3" id="text-org092d4b2">
<p>
get started video - <a href="https://www.youtube.com/watch?v=LIFvgrRxdt4&amp;ab_channel=RyanSchachte">https://www.youtube.com/watch?v=LIFvgrRxdt4&amp;ab_channel=RyanSchachte</a>
</p>

<p>
second video - <a href="https://www.youtube.com/watch?v=hjD9jTi_DQ4&amp;t=2225s&amp;ab_channel=EnvatoTuts%2B">https://www.youtube.com/watch?v=hjD9jTi_DQ4&amp;t=2225s&amp;ab_channel=EnvatoTuts%2B</a>
</p>
</div>
</div>

<div id="outline-container-org183a2cc" class="outline-3">
<h3 id="org183a2cc">commands</h3>
<div class="outline-text-3" id="text-org183a2cc">
<ul class="org-ul">
<li>hugo new site nameofthesite</li>
<li>cd themes git clone theme</li>
<li>change config.toml to config.yml</li>
<li>hugo server - works</li>
<li>hugo new posts/firstpost.md</li>
<li>git submodule add -b master <a href="https://github.com/arvydasg/arvydasg.github.io.git">https://github.com/arvydasg/arvydasg.github.io.git</a>
public (public where file will be stored)</li>
<li>hugo -t hugo-PaperMod</li>
<li>cd public</li>
<li>git remote -v (origin is not what you expected ;) its arvydas.github.io</li>
<li>push public folder and site is live!</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-12-13 Wed 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6)</p>
</div>
</body>
</html>